Revit 2027 API
IndependentTag.GetLeaderEnd Method
 Gets the free end point for the leader to the specified reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetLeaderEnd(
	Reference referenceTagged
)
Public Function GetLeaderEnd (
	referenceTagged As Reference
) As XYZ
public:
XYZ^ GetLeaderEnd(
	Reference^ referenceTagged
)
member GetLeaderEnd :
        referenceTagged : Reference -> XYZ
Parameters
referenceTagged Reference
 The reference which is tagged.
Return Value
XYZ
 A point representing the free end location for the leader.
Exceptions
Exception | Condition
ArgumentException |  There is no leader end because the tag does not use a free end leader or the leader is not visible. -or- The specified reference is not currently tagged.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The IndependentTag object does not have a tag behavior.
Remarks
 Tags with attached leader ends or no leaders do not return free leader end points. LeaderEndCondition for the tag's leader end condition.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace